{
    "pageTitle": "Chris Gregori",
    "contactMe": "chrisgreg23@googlemail.com",
    "social": {
      "facebook": "https://www.facebook.com/chris.gregori.9",
      "twitter": "http://www.twitter.com/@_ChrisGreg",
      "linkedIn": "https://www.linkedin.com/in/chrisgregori",
      "instagram": "https://www.instagram.com/chrisgregori__/",
      "github": "http://www.github.com/chrisgreg",
      "blog": "https://medium.com/@chrisgregori/",
      "society6": "https://society6.com/chrisgregori",
      "flickr": "https://www.flickr.com/photos/143093443@N07/"
    },
    "about": "Current work is based on presentational layers for e-commerce applications at NET-A-PORTER primarily utilising Node.js and React.<br><br>I'm also a very amateur photographer - you can find my shots here, on my flickr or buy them from <a href='https://society6.com/chrisgregori'>Society6</a>.<br><br>Get in contact with me below.",
    "education": {
          "course": "BSc (Hons) Software Engineering",
          "university": "City University, London",
          "date": {
                "start": "September 2010",
                "end": "July 2014"
          },
          "description": "A specialist focus on the programming and development of large and complex software, with an emphasis on dependable systems.",
          "classification": "I Class Honours"
    },
    "projects": [
      {
        "name": "Squard",
        "type": "iOS Game",
        "description": "A fast and challenging 2D slide-action game. Swipe your square around the block and dodge the incoming projectiles!<br>Out now on iOS for free! ",
        "url": "https://itunes.apple.com/gb/app/squard/id991757066?mt=8"
      },
      {
        "name": "Rainbow Drop",
        "type": "Android Game",
        "description": "A fast-paced 2D slide-action game with rogue-like features.!<br>Out now on Google Play Store for free! ",
        "url": "https://play.google.com/store/apps/details?id=com.Chris.Rainbow_Drop_Advert"
      },
      {
        "name": "/r/ollage",
        "type": "Website",
        "description": "A Tiny NodeJS application I created on a Sunday to try out Node.<br>The application uses the redwrap reddit API wrapper and the CollagePlus JQuery plugin to gather images from a subreddit specified and return an image collage.<br><br>Generated 500+ collages in it's first week of uptime",
        "url": "https://rollage.herokuapp.com"
      },
      {
        "name": "Play Date",
        "type": "Website",
        "description": "Built natively in Javascript and PHP, Play Date is a mobile-friendly, responsive site I created to help gamers keep up to date with the dates their favorite games are scheduled to be released. <br>Play Date has been featured in several articles across several popular technology/gaming news sites and blogs. The immediate exposure brought in <b>40,000</b> hits in <b>3 days</b>, and took the average daily user base to <b>1000+</b>. <br><br> The flood of requests led to me to implement RSS feed support and iCalendar and Google Calendar export and subscription meaning users are now able to subscribe to the site and have an automatically updating video-game calendar on their preferred device.<br><br>Articles regarding Play Date:<ul style='padding-top:2%'><li><a href='http://kotaku.com/a-handy-way-to-know-when-all-the-games-come-out-1624068561'>Kotaku - Video Game Blog</a></li><li><a href='http://www.kotaku.co.uk/2014/08/19/handy-way-know-games-come'>Kotaku UK - Video Game Blog</a></li><li><a href='http://www.dailydot.com/geek/play-date-game-calendar/'>The Daily Dot - The 'hometown' newspaper of the internet</a></li><li><a href='http://vulcanpost.com/17529/play-date-video-game-release-date/'>Vulcan Post - Tech News</a></li></ul>",
        "url": "http://www.chrisgregori.co.uk/playdate"
      },
      {
        "name": "Play Date iOS",
        "type": "iOS Application",
        "description": "The well received web application comes native to iOS! Built natively in Swift for both iPhone and iPad, the Play Date iOS application lets you view game release dates for the consoles you care about!<br><ul><li>Filter by Consoles!</li><li>Filter by Regions - UK, USA, Australia and Japan!</li><li>Set yourself iCal reminders straight into your phone for the games you care about!</li><li>100% Free!</li></ul>",
        "url": "https://itunes.apple.com/gb/app/play-date-video-game-release/id987119779?mt=8"
      },
      {
        "name": "MALit!",
        "type": "Chrome Extension",
        "description": "A slightly faster way to get information about your anime. <br><br>This Chrome extension adds an option to your context menu to allow you to search MyAnimeList (an Anime Encyclopedia site) for the term highlighted.<br><br>Used <b>1100+</b> times in it's first week of publishing! <br>Used <b>10000+</b> times in it's first six months of uptime!",
        "url": "https://chrome.google.com/webstore/detail/mal-it/pjdgiiaakebiogakdnccbohgnbkndnjn"
      },
      {
        "name": "MALfo!",
        "type": "Chrome Extension",
        "description": "A Tiny Chrome Extension I created which compliments MALit!. <br><br>The extension automatically crawls MyAnimeList (an anime encyclopedia) links on Reddit.com to provide statistics for said anime next to said link!<br><br>Well recieved, generated <b>21000+</b> instances of information in it's first week of publishing!<br>Generated <b>150,000+</b> instances of information in it's first six months of uptime!",
        "url": "https://chrome.google.com/webstore/detail/malfo/lnehgeipjejfchpiecclhnlgohmhilcc/"
      }
    ],
    "work": [
          {
            "company": "Net-a-Porter",
            "role": "Associate Software Engineer",
            "date": {
              "start": "November 2015",
              "end": "..."
            },
            "description": "Assosciate Full-Stack JavaScript Software Engineer primarily working on the NET-A-PORTER & Mr Porter sites - previously worked on The Outnet.com.",
            "projects": [
                 {
                       "description": "Designed and implemented test-driven solutions for features on the Mr Porter and Net-a-Porter product listing and details applications utilising vanilla JavaScript, Polymer, React and Redux."
                 },
                 {
                       "description": "Led the development of a new Vue.js client-side application for The Outnets My Account page."
                 },
                 {
                       "description": "Worked as part of a two-man team to architect, design and implement a new authentication system for the entire company utilising JWT in Java 8."
                 },
                 {
                       "description": "Redesigned The Outnet.com header."
                 },
                 {
                       "description": "Won Fullstack 2016 hackday alongside two colleagues by creating a light-based theremin using a Tessel 2 dev kit."
                 },
                 {
                       "description": "Contributed to multiple scripts, build tools and applications throughout the company."
                 }
            ],
            "tech": [
              "Node.js",
              "React.js",
              "Polymer",
              "Vue.js",
              "ES6",
              "JavaScript",
              "Java 8",
              "JWT",
              "SCSS"
            ]
          },
          {
            "company": "Net-a-Porter",
            "role": "Graduate Software Engineer",
            "date": {
              "start": "September 2014",
              "end": "November 2015"
            },
            "description": "Graduate Software Engineering Scheme based on rotations in Software Testing, Software Development and Dev Ops. Exposing me to various technologies, including Java, Perl, Scala, Ruby, JavaScript and iOS development.",
            "project_title": "Focus Points & Highlights",
            "projects": [
                 {
                       "name": "Perl",
                       "description": "Enhanced and maintained several core production backend applications in Perl 5 utilising PostgreSQL, DBIx and the Catalyst MVC Framework. ",
                       "tech": [
                             "Perl",
                             "Catalyst",
                             "PostgreSQL",
                             "ActiveMQ JMS",
                             "AJAX",
                             "Linux",
                             "Git"
                       ]
                 },
                 {
                   "description": "Built a new in-house admin tool as part of a two man team using Perl, Catalyst, ActiveMQ JMS, AJAX and PostgreSQL."
                 },
                 {
                       "name": "Java 8 / Spring",
                       "description": "Worked on various areas of the Mr.Porter web application implementing RESTful API endpoints.",
                       "tech": [
                             "Java",
                             "Gradle",
                             "JSP",
                             "MySQL"
                       ]
                 },
                 {
                   "description": "Integration with backend API's via POJO's, DAO's, Services and Circuit Breaker design pattern."
                 },
                 {
                       "name": "React",
                       "description": "Lead the implementation of a React based user-generated-content and product details page - <a href='https://www.thenetset.com/i/576433e16700003600d5f217'>Example page</a>.",
                       "tech": [
                             "Node.js",
                             "React.js",
                             "ES6",
                             "JavaScript",
                             "Webpack",
                             "Grunt"
                       ]
                 },
                 {
                       "name": "Responsive SASS / Styling",
                       "description": "Worked on various areas of the Mr.Porter site furniture, adding mobile-first responsive CSS for tablet and desktop versions.",
                       "tech": [
                             "Node.js",
                             "CSS",
                             "SASS",
                             "JavaScript"
                       ]
                 },
                 {
                   "description": "Refactored javascript to updated best practises."
                 },
                 {
                       "name": "Ruby Automation",
                       "description": "Worked with automation testers to enhance, maintain and improve a BDD Ruby Gherkin Test suite used to frequently test core applications by writing gherkin scripts and native ruby code.",
                       "tech": [
                             "Ruby",
                             "Cucumber",
                             "Capybara",
                             "Site Prism"
                       ]
                 },
                 {
                   "description": "Won an internal hackday as part of a two man team by creating a staff discount notification service using Node.js and MongoDB."
                 },
                 {
                   "description": "Came second in an internal hackday as part of a team by creating a temporary drag-and-drop shopping bag on the Mr Porter product listing page in vanilla JavaScript and jQuery."
                 }
            ],
            "tech": [
              "Node.js",
              "Scala",
              "Java 7",
              "ES6",
              "JavaScript",
              "Perl",
              "SCSS",
              "CSS",
              "Perl",
              "Ruby",
              "Objective-C",
              "Git",
              "Unix",
              "PostgreSQL",
              "MongoDB",
              "Cucumber",
              "ActiveMQ"
            ]
          },
          {
            "company": "Thomson Reuters",
            "role": "Junior Software Engineer",
            "date": {
              "start": "July 2012",
              "end": "August 2013"
            },
            "description": "Year in industry focused on developing, implementing and maintaining tools in C++, C# and VBA to monitor and improve the Elektron Traffic Management System.",
            "projects": [
                 {
                       "description": "Created a desktop Windows application built in C# to replace a legacy application which would analyse server log files by passing data into an XML customisable analysis engine, and output graphs in XLSX format. Old version created the file in ~2 minutes, new version took 5-10 seconds."
                 },
                 {
                       "description": "Created a desktop Windows application in C# which allowed server log file analysis based on XML customisable tests which could allow for inclusion/exclusion of user-defined errors, minimum/maximum timespan of server files, the number of errors and other user customisable settings. Features included built-in folder-recursive .tgz file extraction, and a built-in XML editor with code-folding and syntax highlighting."
                 },
                 {
                       "description": "Worked on a C++ applciation which displayed real-time server information updatable at customisable intervals, and allowed for actions such as server state alteration, and pushing and pulling of files to the server remotely."
                 },
                 {
                       "description": "Implemented and maintained several VBA scripts which connected to backend internal databases to automatically pull statistics and values to populate a Microsoft Spreadsheet - this data was plotted and analysed for use within the company."
                 }
            ],
            "tech": [
              "C#",
              "C++",
              "PHP",
              "VBA",
              "Tortoise SVN",
              "Windows",
              "Linux"
            ]
          }
    ]
}
